{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 My name is Christopher Yamas, and I am a Software Developer with a focus and proficiency in both Python and JavaScript. In my prior experience as a director of political campaigns, I was frequently commended by my peers and superiors for being solutions-oriented, as well as steadfast in my commitment to a psychologically safe team culture. Along the way, I gained a greater desire for career stability and more dynamic hard skills, which has led me to software development through object-oriented programming languages. In terms of my current career goals, I’m eager for the opportunity to help advance life-enriching technologies for an industry-leading firm that has a net-positive environmental impact.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Horns, A Gallery",
        "startDate": "March 2022",
        "description": "My first foray into React Bootstrap, this application uses Bootstrap Cards to display each horned beast. It functions on the surface like a Facebook or Pinterest of sorts, because the user can click a button to 'Fave' the beast which add's to its overall <3 count, and if the user clicks the beast's image then it will come into the foreground focus as a modal on the page.",
        "images": [
          "images/portfolio/horns/horns1.png",
          "images/portfolio/horns/horns2.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Salmon Cookies",
        "startDate": "February 2022",
        "description": "I was tasked with setting up a site for a fictional business that sells Salmon Cookies at five different stores across the globe. The main page has internal and external page navigation, and incorporates a fair amount of CSS. The sales page utilizes Javascript to calculate and populate the cookies per hour sold (using random inputs) and each location, and even allows users to add inputs for new locations.",
        "images": [
          "images/portfolio/salmon/salmon1.png",
          "images/portfolio/salmon/salmon2.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Code 401 Python Project",
        "startDate": "April 2022",
        "description": "This was my first project using Python in my Advanced Software Development in Python course with Code Fellows. I'm really excited about what we were able to build and the services it offers, as well as its potential.",
        "images": [
          "images/portfolio/python/p1.jpg",
          "images/portfolio/python/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Code Fellows",
        "title": "Software Developer Student",
        "years": "01.2022 - present",
        "mainTech": [
          "Education"
        ],
        "technologies": [
          "REST API",
          "JavaScript",
          "Bootstrap"
        ]
      },
      {
        "company": "Various Political Campaigns",
        "title": "Field Director",
        "years": "06.2019 - 01.2021",
        "mainTech": [
          "Career"
        ],
        "technologies": [
        ]
      }
    ]
  }
